aniruddhanalgirkar-eaton/wifi_stm/drivers/wifi/infineon_wifi/pal/targets/TARGET_STM32/Src/stm32_cyhal_sdio - chip_id_ok.c
      stm32_cypal_sdio_hw_init(&hsd);

    // Init the low level hardware : GPIO, CLOCK, CORTEX...etc
       if (obj->hsd->State == HAL_SD_STATE_RESET)
       {
           // Allocate lock resource and initialize it
           obj->hsd->Lock = HAL_UNLOCKED;

           HAL_SD_MspInit(obj->hsd);
       }
#if defined (WICED)
       /*!< Enable the SDIO AHB Clock and the DMA2 Clock */
    do {
	   __IO uint32_t tmpreg;
	   SET_BIT(RCC->AHB1ENR, RCC_AHB1ENR_DMA2EN);

	   // Delay after an RCC peripheral clock enabling
	   tmpreg = READ_BIT(RCC->AHB1ENR, RCC_AHB1ENR_DMA2EN);
	   UNUSED(tmpreg);
	   } while(0);

#if defined (SDIO)
    {
    	if (obj->hsd->Instance == SDIO)
    	{
    	do {
    	   __IO uint32_t tmpreg;
    	   SET_BIT(RCC->APB2ENR, RCC_APB2ENR_SDIOEN);

    	   // Delay after an RCC peripheral clock enabling
    	   tmpreg = READ_BIT(RCC->APB2ENR, RCC_APB2ENR_SDIOEN);
    	   UNUSED(tmpreg);
    	   } while(0);
    	}
    }
    #endif
#endif //WICED

//ANN added below
    sdio_init_structure.ClockDiv = (uint8_t)0;
    sdio_init_structure.ClockEdge = SDIO_CLOCK_EDGE_RISING;
    //sdio_init_structure.ClockBypass = 0;
    sdio_init_structure.ClockPowerSave = SDIO_CLOCK_POWER_SAVE_DISABLE;
    sdio_init_structure.BusWide = SDIO_BUS_WIDE_4B; //ANN: as per WICED 1B
    sdio_init_structure.HardwareFlowControl = SDIO_HARDWARE_FLOW_CONTROL_DISABLE;


    (void)SDIO_Init(obj->hsd->Instance, sdio_init_structure);
    (void)SDIO_PowerState_ON(obj->hsd->Instance);
    (void)SDIO_SetSDMMCReadWaitMode(obj->hsd->Instance, SDIO_READ_WAIT_MODE_CLK);
/*
    hsd.Init.ClockDiv = (uint8_t)120; //ANN from WICED
    hsd.Init.ClockEdge = SDIO_CLOCK_EDGE_RISING;
    hsd.Init.ClockPowerSave = SDIO_CLOCK_POWER_SAVE_DISABLE;
    hsd.Init.BusWide = SDIO_BUS_WIDE_1B; //ANN: as per WICED
    hsd.Init.HardwareFlowControl = SDIO_HARDWARE_FLOW_CONTROL_DISABLE;


    // Check the parameters
    assert_param(NULL != obj);

    // Update obj sd handle
    obj->hsd = &hsd; //_cyhal_sdio_handle;

    // Check the SD handle allocation
    if (obj->hsd == NULL)
    {
        return (cy_rslt_t)HAL_ERROR;
    }

    // Enable SDIO block
    _stm32_sdio_enable_hw_block(obj);
*/

    // Init Clock should be less or equal to 400Khz
    //sdmmc_clk = (LL_RCC_GetSDIOClockFreq(LL_RCC_SDIO_CLKSOURCE))/120;

    //__HAL_RCC_SDIO_CLK_DISABLE();

    hsd.Instance->CLKCR |= SDIO_CLKCR_CLKEN;

       // Initialize the error code
    obj->hsd->ErrorCode = HAL_SD_ERROR_NONE;

    // store object in handle context
    obj->hsd->Context = (uint32_t)obj;

    // Initialize the SD state
    obj->hsd->State = HAL_SD_STATE_READY;

    // Enable interrupts
    _stm32_sdio_enable_irq(obj->hsd->Instance, CYHAL_SDIO_IRQ_PRIORITY, true);

    my_sdio_isr_installer();
    my_dma2_isr_installer();

    return CY_RSLT_SUCCESS;
}

//ANN added below function
//void SDMMC1_IRQHandler(void )
//void SDIO_IRQHandler(void)
/*void SDIO_irq(void)
{
    stm32_cyhal_sdio_irq_handler();
}*/



/***************************************************************************************************
 * cyhal_sdio_configure
 **************************************************************************************************/
cy_rslt_t cyhal_sdio_configure(cyhal_sdio_t* obj, const cyhal_sdio_cfg_t* config)
{
    uint32_t clk_freq;

    /* Check the parameters */
    assert_param(NULL != obj);

    /* Update obj sd handle */
    if (obj->hsd == NULL)
    {
        obj->hsd = _cyhal_sdio_handle;
    }

    hsd.Instance = SDIO;

/*
#if defined (WICED)
       //*!< Enable the SDIO AHB Clock and the DMA2 Clock
       //RCC_AHB1PeriphClockCmd( RCC_AHB1Periph_DMA2, ENABLE );
       //RCC_APB2PeriphClockCmd( RCC_APB2Periph_SDIO, ENABLE );

#if defined (SDIO)
    {
    	if (obj->hsd->Instance == SDIO)
    	{
    	do {
    	   __IO uint32_t tmpreg;
    	   //SET_BIT(RCC->AHB2ENR, 0x00000200);
    	   SET_BIT(RCC->APB2ENR, RCC_APB2ENR_SDIOEN);

    	   // Delay after an RCC peripheral clock enabling
    	   tmpreg = READ_BIT(RCC->APB2ENR, RCC_APB2ENR_SDIOEN);
    	   UNUSED(tmpreg);
    	   } while(0);
    	}
    }
    #endif
#endif //WICED
*/


    /* Do not change frequency if requested value is zero */
    if (config->frequencyhal_hz != 0u)
    {
        /* Override the SDMMC Clock frequency Configuration if defined */
        #ifdef SDMMC_CLK_FREQ_OVERRIDE
        clk_freq = SDMMC_CLK_FREQ_OVERRIDE;
        #else
        clk_freq = config->frequencyhal_hz;
        #endif
        obj->frequencyhal_hz = clk_freq;

        /* Calculate SDMMC Clock divider. */
        /* ClockDiv = SDMMC input clock / (2 * Expected SDMMC Clock) */
        //uint32_t sdmmc_clk = HAL_RCCEx_GetPeriphCLKFreq(STM32_RCC_PERIPHCLK_SDMMC);

        uint32_t sdmmc_clk = LL_RCC_GetSDIOClockFreq(LL_RCC_SDIO_CLKSOURCE);
        obj->hsd->Init.ClockDiv = _stm32_safe_divide(sdmmc_clk, 2U * clk_freq);

        //ANN commented as CKCR.CLKEN bit is getting reset & causing CMD52 to CMDACT flag set always
        /* Reset and Enable SDIO block */
        //_stm32_sdio_enable_hw_block(obj);
    }

    /* Do not change block size if requested value is zero */
    if (config->block_size != 0u)
    {
        obj->block_size = config->block_size;
    }

    return CY_RSLT_SUCCESS;
}


/***************************************************************************************************
 * cyhal_sdio_send_cmd
 **************************************************************************************************/
cy_rslt_t cyhal_sdio_send_cmd(const cyhal_sdio_t* obj, cyhal_transfer_t direction,
                              cyhal_sdio_command_t command, uint32_t argument, uint32_t* response)
{
    (void)direction;
    uint32_t ret;
    /* Check the parameters */
    assert_param(obj != NULL);
    assert_param(obj->hsd != NULL);

    k_msleep(1);

    switch (command)
    {
        /* CMD0 */
        case CYHAL_SDIO_CMD_GO_IDLE_STATE:
        	ret = SDMMC_CmdGoIdleState(obj->hsd->Instance);
            break;

        /* CMD3 */
        case CYHAL_SDIO_CMD_SEND_RELATIVE_ADDR:
        {
            uint16_t resp;
            assert_param(response != NULL);
            ret = SDMMC_CmdSetRelAdd(obj->hsd->Instance, &resp);
            *response = resp;
            //*response = resp<<16; //In WICED, we are not bothered about different error flags as in function ll "SDMMC_GetCmdResp6"
            // we are getting the same R6 reponse of 0x10000 there, but its been >>16 times based on some flag setting
            break;
        }

        /* CMD5 */
        case CYHAL_SDIO_CMD_IO_SEND_OP_COND:
        	ret = _stm32_sdio_cmd_send_op_cond(obj->hsd->Instance);
        	  // *response = SDIO->RESP1; //ANN added this from WICED
        	break;

        /* CMD7 */
        case CYHAL_SDIO_CMD_SELECT_CARD:
        	ret = SDMMC_CmdSelDesel(obj->hsd->Instance, (uint64_t)argument << 16);
        	//ret = SDMMC_CmdSelDesel(obj->hsd->Instance, (uint64_t)argument);
            break;

        /* CMD52 */
        case CYHAL_SDIO_CMD_IO_RW_DIRECT:
            /* this one already has  != NULL check inside */
            ret = _stm32_sdio_cmd_rw_direct(obj->hsd->Instance, argument, response);
            break;

        /* CMD53 */
        case CYHAL_SDIO_CMD_IO_RW_EXTENDED:
            /* this one already has  != NULL check inside */
            ret = _stm32_sdio_cmd_rw_extended(obj->hsd->Instance, argument, response);
            break;

        case CYHAL_SDIO_CMD_GO_INACTIVE_STATE:
        default:
            ret = CYHAL_SDIO_RSLT_ERR_BAD_PARAM;
            break;
    }
    return ret;
}


/***************************************************************************************************
 * cyhal_sdio_bulk_transfer
 **************************************************************************************************/
//#if(0)
cy_rslt_t cyhal_sdio_bulk_transfer(cyhal_sdio_t* obj, cyhal_transfer_t direction, uint32_t argument,
                                   const uint32_t* data, uint16_t length, uint32_t* response)
{
    uint32_t loop_count = 0;
    whd_result_t result;
    uint16_t attempts = 0;

    sdio_block_size_t block_size;
    uint16_t data_size = length;

   //whd_assert("Bad args", !((command == CYHAL_SDIO_CMD_IO_RW_EXTENDED) && (data == NULL)));

    if ( response != NULL )
    {
        *response = 0;
    }

    //platform_mcu_powersave_disable();

