aniruddhanalgirkar-eaton/wifi_stm/drivers/wifi/infineon_wifi/pal/targets/TARGET_STM32/Src/stm32_cyhal_sdio - chip_id_ok.c
        /* Call CMD53 (CYHAL_SDIO_CMD_IO_RW_EXTENDED) */
        result = cyhal_sdio_send_cmd(obj, direction, CYHAL_SDIO_CMD_IO_RW_EXTENDED,
                                     arg.value, response);

        /* Check error from CMD53 */
        if (result != HAL_SD_ERROR_NONE)
        {
            /* Clear all the static flags */
            __HAL_SD_CLEAR_FLAG(obj->hsd, SDMMC_STATIC_FLAGS);
            obj->hsd->State = HAL_SD_STATE_READY;
            return result;
        }

        /* Check if there were any SDIO errors */
		if ( ( SDIO->STA & ( SDIO_STA_DTIMEOUT | SDIO_STA_CTIMEOUT ) ) != 0 )
		{
			return CYHAL_SDIO_RET_CMD_TIMEOUT;
		}
		else if ( ( ( SDIO->STA & ( SDIO_STA_CCRCFAIL | SDIO_STA_DCRCFAIL | SDIO_STA_TXUNDERR | SDIO_STA_RXOVERR ) ) != 0 ) )
		{
			return CYHAL_SDIO_RET_CMD_TIMEOUT;
		}


/*
         Set polling flags
        flags = SDIO_FLAG_DCRCFAIL | SDIO_FLAG_DTIMEOUT | SDIO_FLAG_DATAEND |
                SDIO_FLAG_TXUNDERR | SDIO_FLAG_RXOVERR;
*/
        /* Poll on SDMMC flags */
        while ((!__HAL_SD_GET_FLAG(obj->hsd, flags)) && (timeout > 0u))
        {
            // returning ERROR code for timeout
            //HAL_Delay(1U);
            k_msleep(1);
            //K_MSEC	(1);
        	//for(int i=0;i<1000;i++);
            timeout--;
            if (timeout == 0u)
            {
                obj->hsd->State = HAL_SD_STATE_READY;
                return CYHAL_SDIO_RET_CMD_TIMEOUT;
            }
        }


        /* Check for SDMMC interrupt flags */
        if (__HAL_SD_GET_FLAG(obj->hsd, SDIO_FLAG_DATAEND) != RESET)
        {
            __HAL_SD_CLEAR_FLAG(obj->hsd, SDIO_FLAG_DATAEND);
        }
        else if (__HAL_SD_GET_FLAG(obj->hsd, SDIO_FLAG_DCRCFAIL | SDIO_FLAG_DTIMEOUT |
                                   SDIO_FLAG_RXOVERR | SDIO_FLAG_TXUNDERR) != RESET)
        {
            /* Set Error code */
            if (__HAL_SD_GET_FLAG(obj->hsd, SDIO_FLAG_DCRCFAIL) != RESET)
            {
                obj->hsd->ErrorCode |= HAL_SD_ERROR_DATA_CRC_FAIL;
            }
            if (__HAL_SD_GET_FLAG(obj->hsd, SDIO_FLAG_DTIMEOUT) != RESET)
            {
                obj->hsd->ErrorCode |= HAL_SD_ERROR_DATA_TIMEOUT;
            }
            if (__HAL_SD_GET_FLAG(obj->hsd, SDIO_FLAG_RXOVERR) != RESET)
            {
                obj->hsd->ErrorCode |= HAL_SD_ERROR_RX_OVERRUN;
            }
            if (__HAL_SD_GET_FLAG(obj->hsd, SDIO_FLAG_TXUNDERR) != RESET)
            {
                obj->hsd->ErrorCode |= HAL_SD_ERROR_TX_UNDERRUN;
            }
        }
        else
        {
            /* Nothing to do */
        }

        /* Set SDIO to init state */
        //ANN: please ensure the obj->hsd is pointing to correct base address of required stream/channel
        __HAL_SD_DISABLE_IT(obj->hsd, SDIO_IT_TXFIFOF);
//        __HAL_SD_DISABLE_IT(obj->hsd, SDIO_IT_TXFIFOF);
        //ANN: please ensure (STM32F4) SDIO_IT_TXFIFOF == (STM32H7) SDMMC_IT_IDMABTC. refer stm32l4xx_ll_sdmmc.h & stm32f4xx_ll_sdmmc.h

        //ANN commented below as for STM32F4
        //__SDMMC_CMDTRANS_DISABLE(obj->hsd->Instance);

        obj->hsd->Instance->DLEN     = 0;
        obj->hsd->Instance->DCTRL    = SDIO_DCTRL_SDIOEN;
        //obj->hsd->Instance->IDMACTRL = SDMMC_DISABLE_IDMA;
        __SDIO_OPERATION_DISABLE(obj->hsd->Instance);
        obj->hsd->Instance->CMD      = 0;
        //ANN: please check if it's required to reset FIFO, if so, then do it by finding right bit.
        //obj->hsd->Instance->DCTRL   |= SDMMC_DCTRL_FIFORST;

        /* Clear all the static flags */
        __HAL_SD_CLEAR_FLAG(obj->hsd, SDIO_STATIC_DATA_FLAGS);

        /* Copy received data to user */
        if ((direction == CYHAL_READ) && (use_temp_dma_buffer) && (!obj->hsd->ErrorCode))
        {
            (void)memcpy((void*)data, (void*)_temp_dma_buffer, (size_t)length);
        }

        /* Set the SD state to ready to be able to start again the process */
        _cyhal_sdio_handle->State = HAL_SD_STATE_READY;

        /* This interrupt is disabled in interrupt handler so need to enable it here */
        if (0U != ((uint32_t)CYHAL_SDIO_CARD_INTERRUPT & obj->irq))
        {
            __HAL_SD_ENABLE_IT(obj->hsd, SDIO_IT_SDIOIT);
        }
    }
    else
    {
        obj->hsd->ErrorCode |= HAL_SD_ERROR_BUSY;
        return CYHAL_SDIO_RSLT_ERR_PM_PENDING;
    }

    if (obj->hsd->ErrorCode == HAL_SD_ERROR_NONE)
    {
        result = CY_RSLT_SUCCESS;
    }
    else
    {
        result = CYHAL_SDIO_RET_NO_SP_ERRORS; /**< Non-specific error code*/
    }
    return result;
}

#endif

#pragma GCC pop_options

#if defined(__cplusplus)
}
#endif
